# Pandas

### Read CSV file with various Parameter

In [4]:
## import numpy
import numpy as np

##import pandas
import pandas as pd

In [17]:
## reading csv file and considering col with 0 index as index_col  
df=pd.read_csv('test.csv', index_col = 0)
## print df
df.head()

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [8]:
## to get info abount the file
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, row1 to row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int64
 1   col2    5 non-null      int64
 2   col3    5 non-null      int64
 3   col4    5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [12]:
## using seperater parameter iwhile reading csv file
df_1 =pd.read_csv('test2.csv',sep=';',index_col=0)
df_1

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [9]:
df.describe().

            col1       col2       col3       col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [21]:
df['col2'].value_counts()

13    1
5     1
17    1
9     1
1     1
Name: col2, dtype: int64

In [20]:
df[df['col1']>10]

      col1  col2  col3  col4
row4    12    13    14    15
row5    16    17    18    19

## StringIO()

In [10]:
from io import StringIO,BytesIO

In [1]:
data = ('col1,col2,col3\n'
       'x,y,1\n'
       'a,b,2\n')

In [2]:
type(data)

str

In [20]:
## Read from specific column
df= pd.read_csv(StringIO(data),usecols=['col1','col3'])
df

  col1  col3
0    x     1
1    a     2

In [22]:
## Create new csv file from dataframe
df.to_csv('data1.csv')

## Specifying Column data type

In [24]:
data =('a,b,c,d\n'
        '1,2,3,4\n'
        '5,6,7,8\n'
        '9,10,11,\n')

In [28]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,

In [26]:
type(data)

str

In [45]:
## Creating DataFrame and setting datatype as object
df=pd.read_csv(StringIO(data),dtype=object)
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [46]:
## Creating DataFrame and setting datatype as int
data =('a,b,c,d\n'
        '1,2,3,4\n'
        '5,6,7,8\n'
        '9,10,11,12\n')
df=pd.read_csv(StringIO(data),dtype=int)
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [32]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int64

In [48]:
## Assigning diff datatypes for all columns
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':object,'d':float})
df

   a     b   c     d
0  1   2.0   3   4.0
1  5   6.0   7   8.0
2  9  10.0  11  12.0

In [47]:
## Checking the datatype of columns
df.dtypes

a    int64
b    int64
c    int64
d    int64
dtype: object

In [54]:
 data=('index,a,b,c\n'
       '4,apple,bat,5.7\n'
       '8,orrange,cow,10\n')
print(data)

index,a,b,c
4,apple,bat,5.7
8,orrange,cow,10

In [55]:
pd.read_csv(StringIO(data),index_col=0)

             a    b     c
index
4        apple  bat   5.7
8      orrange  cow  10.0

In [62]:
 data=('a,b,c\n'
       '4,apple,bat,\n'
       '8,orrange,cow,\n')

In [63]:
df=pd.read_csv(StringIO(data))
df

         a    b   c
4    apple  bat NaN
8  orrange  cow NaN

In [64]:
df=pd.read_csv(StringIO(data),index_col=False)
df

   a        b    c
0  4    apple  bat
1  8  orrange  cow

In [65]:
## Using usecol and index
df=pd.read_csv(StringIO(data),usecols=['b','c'], index_col=False)
df

         b    c
0    apple  bat
1  orrange  cow

In [66]:
## Quaoting and Escaping Charecter
data ='a,b\n"hello,\\"Bob\\",nice to meet you",5'

In [69]:
pd.read_csv(StringIO(data),escapechar='\\')

                              a  b
0  hello,"Bob",nice to meet you  5

In [70]:
## URL toCSV
df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item', sep='\t')
df.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,399
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,374
4,SA0L1,All items less food,1,T,358